Revit 2027 API
ParameterTypeId.RebarSystemHookOrientTopDirn2 Property
 "Top Minor Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookOrientTopDirn2 { get; }
Public Shared ReadOnly Property RebarSystemHookOrientTopDirn2 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookOrientTopDirn2 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookOrientTopDirn2 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace